app/Http/Controllers/UserController.php

    public function trashed()
    {

        $users = User::onlyTrashed()->paginate();
---
select * from `users` where `users`.`deleted_at` is null limit 15 offset 0