app/Http/Controllers/UserController.php

select * from `users` where (CONCAT(first_name, " ", last_name) like '%berly p%' or `email` like '%berly p%' or exists (select * from `teams` where `users`.`team_id` = `teams`.`id` and `name` like '%berly p%')) and `users`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
    	$users = User::query()
            ->when(request('team'), function($query, $team){
                if($team === 'with_team'){
                    $query->has('team');
                }elseif($team === 'without_team'){
                    $query->doesntHave('team');
                }
            })
            ->when(request('search'), function ($query, $search){
                $query->where(function ($query) use ($search){
                    $query->where('name', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%");
                });

            })
            ->orderByDesc('created_at')
            ->paginate();